tap "yuzeguitarist/deck", trusted: true
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GitHub command-line tool
brew "gh"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Cross-shell prompt for astronauts
brew "starship"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Menu bar usage monitor for Codex and Claude
cask "codexbar"
# Privacy-first clipboard manager
cask "yuzeguitarist/deck/deckclip"
cask "font-blex-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Tool for multi-language users
cask "input-source-pro"
# File archiver
cask "keka"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Window manager
cask "loop"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Free and open-source RSS reader
cask "netnewswire"
# AI coding agent desktop client
cask "opencode-desktop"
# Instant messaging tool
cask "qq"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# EPUB ebook editor
cask "sigil"
# PDF reader and note-taking application
cask "skim"
# Native screenshots, recording, annotation, and editing from the menu bar
cask "snapzy"
# Mux and tag mp4 files
cask "subler"
# Text editor for code, markup and prose
cask "sublime-text"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Cleanup and system status tool
cask "tencent-lemon"
# VPN and WiFi proxy
cask "thunder"
# Charting and social-networking for investment traders
cask "tradingview"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# View output from scripts in the menu bar
cask "xbar"
# Multiplayer code editor
cask "zed"
mas "Magnet", id: 441258766
mas "Plash", id: 1494023538
mas "Theine", id: 955848755
mas "汽水音乐", id: 1605585211
mas "百度网盘", id: 547166701
vscode "anthropic.claude-code"
vscode "esbenp.prettier-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.sublime-keybindings"
vscode "ritwickdey.liveserver"
vscode "shopify.ruby-lsp"
vscode "vizards.deepseek-v4-for-copilot"
